;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Fri Oct 30 05:03:37 2020                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
	.global	_CpuTimer2Regs
_CpuTimer2Regs:	.usect	"CpuTimer2RegsFile",8,1,1
DW$1	.dwtag  DW_TAG_variable, DW_AT_name("CpuTimer2Regs"), DW_AT_symbol_name("_CpuTimer2Regs")
	.dwattr DW$1, DW_AT_location[DW_OP_addr _CpuTimer2Regs]
	.dwattr DW$1, DW_AT_type(*DW$T$339)
	.dwattr DW$1, DW_AT_external(0x01)
	.global	_CpuTimer1Regs
_CpuTimer1Regs:	.usect	"CpuTimer1RegsFile",8,1,1
DW$2	.dwtag  DW_TAG_variable, DW_AT_name("CpuTimer1Regs"), DW_AT_symbol_name("_CpuTimer1Regs")
	.dwattr DW$2, DW_AT_location[DW_OP_addr _CpuTimer1Regs]
	.dwattr DW$2, DW_AT_type(*DW$T$339)
	.dwattr DW$2, DW_AT_external(0x01)
	.global	_FlashRegs
_FlashRegs:	.usect	"FlashRegsFile",8,1,0
DW$3	.dwtag  DW_TAG_variable, DW_AT_name("FlashRegs"), DW_AT_symbol_name("_FlashRegs")
	.dwattr DW$3, DW_AT_location[DW_OP_addr _FlashRegs]
	.dwattr DW$3, DW_AT_type(*DW$T$359)
	.dwattr DW$3, DW_AT_external(0x01)
	.global	_CpuTimer0Regs

	.dwattr DW$38, DW_AT_location[DW_OP_addr _ECanbMOTORegs]
	.dwattr DW$38, DW_AT_type(*DW$T$347)
	.dwattr DW$38, DW_AT_external(0x01)
	.global	_LeftQepRegs
_LeftQepRegs:	.usect	"EQep1RegsFile",64,1,1
DW$39	.dwtag  DW_TAG_variable, DW_AT_name("LeftQepRegs"), DW_AT_symbol_name("_LeftQepRegs")
	.dwattr DW$39, DW_AT_location[DW_OP_addr _LeftQepRegs]
	.dwattr DW$39, DW_AT_type(*DW$T$350)
	.dwattr DW$39, DW_AT_external(0x01)
	.global	_ECanbMOTSRegs
_ECanbMOTSRegs:	.usect	"ECanbMOTSRegsFile",64,1,1
DW$40	.dwtag  DW_TAG_variable, DW_AT_name("ECanbMOTSRegs"), DW_AT_symbol_name("_ECanbMOTSRegs")
	.dwattr DW$40, DW_AT_location[DW_OP_addr _ECanbMOTSRegs]
	.dwattr DW$40, DW_AT_type(*DW$T$346)
	.dwattr DW$40, DW_AT_external(0x01)
	.global	_RightQepRegs
_RightQepRegs:	.usect	"EQep2RegsFile",64,1,1
DW$41	.dwtag  DW_TAG_variable, DW_AT_name("RightQepRegs"), DW_AT_symbol_name("_RightQepRegs")
	.dwattr DW$41, DW_AT_location[DW_OP_addr _RightQepRegs]
	.dwattr DW$41, DW_AT_type(*DW$T$350)
	.dwattr DW$41, DW_AT_external(0x01)
	.global	_DevEmuRegs
_DevEmuRegs:	.usect	"DevEmuRegsFile",208,1,1
DW$42	.dwtag  DW_TAG_variable, DW_AT_name("DevEmuRegs"), DW_AT_symbol_name("_DevEmuRegs")
	.dwattr DW$42, DW_AT_location[DW_OP_addr _DevEmuRegs]
	.dwattr DW$42, DW_AT_type(*DW$T$342)
	.dwattr DW$42, DW_AT_external(0x01)
	.global	_PieVectTable
_PieVectTable:	.usect	"PieVectTableFile",256,1,1
DW$43	.dwtag  DW_TAG_variable, DW_AT_name("PieVectTable"), DW_AT_symbol_name("_PieVectTable")
	.dwattr DW$43, DW_AT_location[DW_OP_addr _PieVectTable]
	.dwattr DW$43, DW_AT_type(*DW$T$263)
	.dwattr DW$43, DW_AT_external(0x01)
	.global	_ECanbMboxes
_ECanbMboxes:	.usect	"ECanbMboxesFile",256,1,1
DW$44	.dwtag  DW_TAG_variable, DW_AT_name("ECanbMboxes"), DW_AT_symbol_name("_ECanbMboxes")
	.dwattr DW$44, DW_AT_location[DW_OP_addr _ECanbMboxes]
	.dwattr DW$44, DW_AT_type(*DW$T$344)
	.dwattr DW$44, DW_AT_external(0x01)
	.global	_ECanaMboxes
_ECanaMboxes:	.usect	"ECanaMboxesFile",256,1,1
DW$45	.dwtag  DW_TAG_variable, DW_AT_name("ECanaMboxes"), DW_AT_symbol_name("_ECanaMboxes")
	.dwattr DW$45, DW_AT_location[DW_OP_addr _ECanaMboxes]
	.dwattr DW$45, DW_AT_type(*DW$T$344)
	.dwattr DW$45, DW_AT_external(0x01)
;	C:\Users\magat\Desktop\source_in_sight\battle\Compiler\bin\opt2000.exe C:\Users\magat\AppData\Local\Temp\TI53210 C:\Users\magat\AppData\Local\Temp\TI5324 
;	C:\Users\magat\Desktop\source_in_sight\battle\Compiler\bin\ac2000.exe --keep_unneeded_types -D_INLINE -DLARGE_MODEL -IC:\Users\magat\Desktop\source_in_sight\battle\include --version=28 --keep_unneeded_types --mem_model:code=flat --mem_model:data=large -m --i_output_file C:\Users\magat\AppData\Local\Temp\TI5322 --template_info_file C:\Users\magat\AppData\Local\Temp\TI5326 --object_file DSP280x_GlobalVariableDefs.obj --embed_opts 10 --call_assumptions=0 --mem_model:code=flat --mem_model:data=large 

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************
DW$46	.dwtag  DW_TAG_far_type
	.dwattr DW$46, DW_AT_type(*DW$T$45)
DW$T$337	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$337, DW_AT_type(*DW$46)
DW$47	.dwtag  DW_TAG_far_type
	.dwattr DW$47, DW_AT_type(*DW$T$46)
DW$T$338	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$338, DW_AT_type(*DW$47)
DW$48	.dwtag  DW_TAG_far_type
	.dwattr DW$48, DW_AT_type(*DW$T$58)
DW$T$339	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$339, DW_AT_type(*DW$48)
DW$49	.dwtag  DW_TAG_far_type
	.dwattr DW$49, DW_AT_type(*DW$T$59)
DW$T$340	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$340, DW_AT_type(*DW$49)
DW$50	.dwtag  DW_TAG_far_type
	.dwattr DW$50, DW_AT_type(*DW$T$62)
DW$T$341	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$341, DW_AT_type(*DW$50)
DW$51	.dwtag  DW_TAG_far_type
	.dwattr DW$51, DW_AT_type(*DW$T$68)
DW$T$342	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$342, DW_AT_type(*DW$51)
DW$52	.dwtag  DW_TAG_far_type
	.dwattr DW$52, DW_AT_type(*DW$T$119)
DW$T$343	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$343, DW_AT_type(*DW$52)
DW$53	.dwtag  DW_TAG_far_type
	.dwattr DW$53, DW_AT_type(*DW$T$131)
DW$T$344	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$344, DW_AT_type(*DW$53)
DW$54	.dwtag  DW_TAG_far_type
	.dwattr DW$54, DW_AT_type(*DW$T$134)
DW$T$345	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$345, DW_AT_type(*DW$54)
DW$55	.dwtag  DW_TAG_far_type
	.dwattr DW$55, DW_AT_type(*DW$T$135)
DW$T$346	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$346, DW_AT_type(*DW$55)
DW$56	.dwtag  DW_TAG_far_type
	.dwattr DW$56, DW_AT_type(*DW$T$136)
DW$T$347	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$347, DW_AT_type(*DW$56)
DW$57	.dwtag  DW_TAG_far_type
	.dwattr DW$57, DW_AT_type(*DW$T$181)
DW$T$348	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$348, DW_AT_type(*DW$57)
DW$58	.dwtag  DW_TAG_far_type
	.dwattr DW$58, DW_AT_type(*DW$T$192)
DW$T$349	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$349, DW_AT_type(*DW$58)
DW$59	.dwtag  DW_TAG_far_type
	.dwattr DW$59, DW_AT_type(*DW$T$210)
DW$T$350	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$350, DW_AT_type(*DW$59)
DW$60	.dwtag  DW_TAG_far_type
	.dwattr DW$60, DW_AT_type(*DW$T$228)
DW$T$351	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$351, DW_AT_type(*DW$60)
DW$61	.dwtag  DW_TAG_far_type
	.dwattr DW$61, DW_AT_type(*DW$T$230)
DW$T$352	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$352, DW_AT_type(*DW$61)
DW$62	.dwtag  DW_TAG_far_type
	.dwattr DW$62, DW_AT_type(*DW$T$234)
DW$T$353	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$353, DW_AT_type(*DW$62)
DW$63	.dwtag  DW_TAG_far_type
	.dwattr DW$63, DW_AT_type(*DW$T$250)
DW$T$354	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$354, DW_AT_type(*DW$63)
DW$64	.dwtag  DW_TAG_far_type
	.dwattr DW$64, DW_AT_type(*DW$T$259)
DW$T$355	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$355, DW_AT_type(*DW$64)

DW$T$263	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$263, DW_AT_name("PIE_VECT_TABLE")
	.dwattr DW$T$263, DW_AT_byte_size(0x100)
DW$65	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$65, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
	.dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
DW$66	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$66, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
	.dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
DW$67	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$67, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
	.dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
DW$68	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$68, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
	.dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
DW$69	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$69, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
	.dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
DW$70	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$70, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
	.dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
DW$71	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$71, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
	.dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
DW$72	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$72, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
	.dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
DW$73	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$73, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
	.dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
DW$74	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$74, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
	.dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
DW$75	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$75, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
	.dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
DW$76	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$76, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
	.dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
DW$77	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$77, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
	.dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
DW$78	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$78, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
	.dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
DW$79	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$79, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
	.dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
DW$80	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$80, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
	.dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
DW$81	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$81, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
	.dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
DW$82	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$82, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
	.dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
DW$83	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$83, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
	.dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
DW$84	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$84, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
	.dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
DW$85	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$85, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
	.dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
DW$86	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$86, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
	.dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
DW$87	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$87, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
	.dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
DW$88	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$88, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
	.dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
DW$89	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$89, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
	.dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
DW$90	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$90, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
	.dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
DW$91	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$91, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
	.dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
DW$92	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$92, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
	.dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
DW$93	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$93, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
	.dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
DW$94	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$94, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
	.dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
DW$95	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$95, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
	.dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
DW$96	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$96, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
	.dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
DW$97	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$97, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
	.dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
DW$98	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$98, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
	.dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
DW$99	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$99, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
	.dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
DW$100	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$100, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
	.dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
DW$101	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$101, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
	.dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
DW$102	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$102, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
	.dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
DW$103	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$103, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
	.dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
DW$104	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$104, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
	.dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
DW$105	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$105, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
	.dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
DW$106	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$106, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
	.dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
DW$107	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$107, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
	.dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
DW$108	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$108, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
	.dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
DW$109	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$109, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
	.dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
DW$110	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$110, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
	.dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
DW$111	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$111, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
	.dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
DW$112	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$112, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
	.dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
DW$113	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$113, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
	.dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
DW$114	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$114, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
	.dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
DW$115	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$115, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
	.dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
DW$116	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$116, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
	.dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
DW$117	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$117, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
	.dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
DW$118	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$118, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
	.dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
DW$119	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$119, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
	.dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
DW$120	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$120, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
	.dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
DW$121	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$121, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
	.dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
DW$122	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$122, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
	.dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
DW$123	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$123, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
	.dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
DW$124	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$124, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
	.dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
DW$125	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$125, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
	.dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
DW$126	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$126, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
	.dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
DW$127	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$127, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
	.dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
DW$128	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$128, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
	.dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
DW$129	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$129, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
	.dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
DW$130	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$130, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
	.dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
DW$131	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$131, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
	.dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
DW$132	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$132, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
	.dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
DW$133	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$133, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
	.dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
DW$134	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$134, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
	.dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
DW$135	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$135, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
	.dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
DW$136	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$136, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
	.dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
DW$137	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$137, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
	.dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
DW$138	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$138, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
	.dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
DW$139	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$139, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
	.dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
DW$140	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$140, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
	.dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
DW$141	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$141, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
	.dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
DW$142	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$142, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
	.dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
DW$143	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$143, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
	.dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
DW$144	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$144, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
	.dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
DW$145	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$145, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
	.dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
DW$146	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$146, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
	.dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
DW$147	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$147, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
	.dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
DW$148	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$148, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
	.dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
	.dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
DW$149	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$149, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
	.dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
DW$150	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$150, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
	.dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
DW$151	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$151, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
	.dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
DW$152	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$152, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
	.dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
DW$153	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$153, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
	.dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
DW$154	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$154, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
	.dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
DW$155	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$155, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
	.dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
DW$156	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$156, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
	.dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
DW$157	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$157, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
	.dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
DW$158	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$158, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
	.dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
DW$159	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$159, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
	.dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
DW$160	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$160, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
	.dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
	.dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$161, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
DW$162	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$162, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
	.dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$163, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$164, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
DW$165	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$165, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
	.dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
DW$166	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$166, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
	.dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
DW$167	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$167, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
	.dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
DW$168	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$168, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
	.dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
	.dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
DW$169	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$169, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
	.dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
DW$170	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$170, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
	.dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
	.dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
DW$171	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$171, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
	.dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
DW$172	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$172, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
	.dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
DW$173	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$173, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
	.dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
DW$174	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$174, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
	.dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
	.dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
DW$175	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$175, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
	.dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
DW$176	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$176, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
	.dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
	.dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
DW$177	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$177, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
	.dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
DW$178	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$178, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
	.dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
	.dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
DW$179	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$179, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
	.dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
DW$180	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$180, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
	.dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
	.dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
DW$181	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$181, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
	.dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
DW$182	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$182, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
	.dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
	.dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
DW$183	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$183, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
	.dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
DW$184	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$184, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
	.dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
	.dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
DW$185	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$185, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
	.dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
DW$186	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$186, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
	.dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
	.dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
DW$187	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$187, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
	.dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
DW$188	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$188, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
	.dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
	.dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
DW$189	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$189, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
	.dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
DW$190	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$190, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
	.dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
	.dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
DW$191	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$191, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
	.dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
DW$192	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$262)
	.dwattr DW$192, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
	.dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
	.dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$263

DW$193	.dwtag  DW_TAG_far_type
	.dwattr DW$193, DW_AT_type(*DW$T$282)
DW$T$356	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$356, DW_AT_type(*DW$193)
DW$194	.dwtag  DW_TAG_far_type
	.dwattr DW$194, DW_AT_type(*DW$T$298)
DW$T$357	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$357, DW_AT_type(*DW$194)
DW$195	.dwtag  DW_TAG_far_type
	.dwattr DW$195, DW_AT_type(*DW$T$316)
DW$T$358	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$358, DW_AT_type(*DW$195)
DW$196	.dwtag  DW_TAG_far_type
	.dwattr DW$196, DW_AT_type(*DW$T$331)
DW$T$359	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$359, DW_AT_type(*DW$196)
DW$197	.dwtag  DW_TAG_far_type
	.dwattr DW$197, DW_AT_type(*DW$T$336)
DW$T$360	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$360, DW_AT_type(*DW$197)
DW$T$262	.dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$261)
	.dwattr DW$T$262, DW_AT_language(DW_LANG_C)

DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$45, DW_AT_name("ADC_REGS")
	.dwattr DW$T$45, DW_AT_byte_size(0x1e)
DW$198	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$198, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
	.dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
DW$199	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$199, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
	.dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
DW$200	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$200, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
	.dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
DW$201	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$201, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
	.dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
DW$202	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$202, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
	.dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
DW$203	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$203, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
	.dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
DW$204	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$204, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
	.dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
DW$205	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
	.dwattr DW$205, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
	.dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
DW$206	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$206, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
	.dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
DW$207	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$207, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
	.dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
DW$208	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$208, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
	.dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
DW$209	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$209, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
	.dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
DW$210	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$210, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
	.dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
DW$211	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$211, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
	.dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
DW$212	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$212, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
	.dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
DW$213	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$213, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
	.dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
DW$214	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$214, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
	.dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
DW$215	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$215, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
	.dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
DW$216	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$216, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
	.dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
DW$217	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$217, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
	.dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
DW$218	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$218, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
	.dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
DW$219	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$219, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
	.dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
DW$220	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$220, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
	.dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
DW$221	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$221, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
	.dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
DW$222	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$222, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
	.dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
DW$223	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$223, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
	.dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
DW$224	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$224, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
DW$225	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$225, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
DW$226	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$226, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
	.dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
DW$227	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$227, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
	.dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$45


DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_name("ADC_RESULT_MIRROR_REGS")
	.dwattr DW$T$46, DW_AT_byte_size(0x10)
DW$228	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$228, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
	.dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
DW$229	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$229, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
	.dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
DW$230	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$230, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
	.dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
DW$231	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$231, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
	.dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
DW$232	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$232, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
	.dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
DW$233	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$233, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
	.dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
DW$234	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$234, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
	.dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
DW$235	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$235, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
	.dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
DW$236	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$236, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
	.dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
DW$237	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$237, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
	.dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
DW$238	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$238, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
	.dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
DW$239	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$239, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
	.dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
DW$240	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$240, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
	.dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
DW$241	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$241, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
	.dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
DW$242	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$242, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
	.dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
DW$243	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$243, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
	.dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$58, DW_AT_name("CPUTIMER_REGS")
	.dwattr DW$T$58, DW_AT_byte_size(0x08)
DW$244	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$244, DW_AT_name("TIM"), DW_AT_symbol_name("_TIM")
	.dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
DW$245	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$245, DW_AT_name("PRD"), DW_AT_symbol_name("_PRD")
	.dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
DW$246	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$246, DW_AT_name("TCR"), DW_AT_symbol_name("_TCR")
	.dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
DW$247	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$247, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
DW$248	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
	.dwattr DW$248, DW_AT_name("TPR"), DW_AT_symbol_name("_TPR")
	.dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
DW$249	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$249, DW_AT_name("TPRH"), DW_AT_symbol_name("_TPRH")
	.dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$58


DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$59, DW_AT_name("CSM_PWL")
	.dwattr DW$T$59, DW_AT_byte_size(0x08)
DW$250	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$250, DW_AT_name("PSWD0"), DW_AT_symbol_name("_PSWD0")
	.dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
DW$251	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$251, DW_AT_name("PSWD1"), DW_AT_symbol_name("_PSWD1")
	.dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
DW$252	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$252, DW_AT_name("PSWD2"), DW_AT_symbol_name("_PSWD2")
	.dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
DW$253	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$253, DW_AT_name("PSWD3"), DW_AT_symbol_name("_PSWD3")
	.dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
DW$254	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$254, DW_AT_name("PSWD4"), DW_AT_symbol_name("_PSWD4")
	.dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
DW$255	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$255, DW_AT_name("PSWD5"), DW_AT_symbol_name("_PSWD5")
	.dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
DW$256	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$256, DW_AT_name("PSWD6"), DW_AT_symbol_name("_PSWD6")
	.dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
DW$257	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$257, DW_AT_name("PSWD7"), DW_AT_symbol_name("_PSWD7")
	.dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$59


DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$62, DW_AT_name("CSM_REGS")
	.dwattr DW$T$62, DW_AT_byte_size(0x10)
DW$258	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$258, DW_AT_name("KEY0"), DW_AT_symbol_name("_KEY0")
	.dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
DW$259	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$259, DW_AT_name("KEY1"), DW_AT_symbol_name("_KEY1")
	.dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
DW$260	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$260, DW_AT_name("KEY2"), DW_AT_symbol_name("_KEY2")
	.dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
DW$261	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$261, DW_AT_name("KEY3"), DW_AT_symbol_name("_KEY3")
	.dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
DW$262	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$262, DW_AT_name("KEY4"), DW_AT_symbol_name("_KEY4")
	.dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
DW$263	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$263, DW_AT_name("KEY5"), DW_AT_symbol_name("_KEY5")
	.dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
DW$264	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$264, DW_AT_name("KEY6"), DW_AT_symbol_name("_KEY6")
	.dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
DW$265	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$265, DW_AT_name("KEY7"), DW_AT_symbol_name("_KEY7")
	.dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
DW$266	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$266, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
	.dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
DW$267	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$267, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
DW$268	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$268, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
	.dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
DW$269	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$269, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
	.dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
DW$270	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$270, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
	.dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
DW$271	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$271, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
	.dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
DW$272	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$272, DW_AT_name("rsvd7"), DW_AT_symbol_name("_rsvd7")
	.dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
DW$273	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$273, DW_AT_name("CSMSCR"), DW_AT_symbol_name("_CSMSCR")
	.dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$62


DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$68, DW_AT_name("DEV_EMU_REGS")
	.dwattr DW$T$68, DW_AT_byte_size(0xd0)
DW$274	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$274, DW_AT_name("DEVICECNF"), DW_AT_symbol_name("_DEVICECNF")
	.dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
DW$275	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$275, DW_AT_name("PARTID"), DW_AT_symbol_name("_PARTID")
	.dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
DW$276	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$276, DW_AT_name("REVID"), DW_AT_symbol_name("_REVID")
	.dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
DW$277	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$277, DW_AT_name("PROTSTART"), DW_AT_symbol_name("_PROTSTART")
	.dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
DW$278	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$278, DW_AT_name("PROTRANGE"), DW_AT_symbol_name("_PROTRANGE")
	.dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
DW$279	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$279, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
	.dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68


DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$119, DW_AT_name("ECAN_REGS")
	.dwattr DW$T$119, DW_AT_byte_size(0x34)
DW$280	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$280, DW_AT_name("CANME"), DW_AT_symbol_name("_CANME")
	.dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
DW$281	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$281, DW_AT_name("CANMD"), DW_AT_symbol_name("_CANMD")
	.dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
DW$282	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$282, DW_AT_name("CANTRS"), DW_AT_symbol_name("_CANTRS")
	.dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
DW$283	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$283, DW_AT_name("CANTRR"), DW_AT_symbol_name("_CANTRR")
	.dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
DW$284	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$284, DW_AT_name("CANTA"), DW_AT_symbol_name("_CANTA")
	.dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
DW$285	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
	.dwattr DW$285, DW_AT_name("CANAA"), DW_AT_symbol_name("_CANAA")
	.dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
DW$286	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$286, DW_AT_name("CANRMP"), DW_AT_symbol_name("_CANRMP")
	.dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
DW$287	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
	.dwattr DW$287, DW_AT_name("CANRML"), DW_AT_symbol_name("_CANRML")
	.dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
DW$288	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$288, DW_AT_name("CANRFP"), DW_AT_symbol_name("_CANRFP")
	.dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
DW$289	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$289, DW_AT_name("CANGAM"), DW_AT_symbol_name("_CANGAM")
	.dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
DW$290	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$290, DW_AT_name("CANMC"), DW_AT_symbol_name("_CANMC")
	.dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
DW$291	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$291, DW_AT_name("CANBTC"), DW_AT_symbol_name("_CANBTC")
	.dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
DW$292	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$292, DW_AT_name("CANES"), DW_AT_symbol_name("_CANES")
	.dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
DW$293	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
	.dwattr DW$293, DW_AT_name("CANTEC"), DW_AT_symbol_name("_CANTEC")
	.dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
DW$294	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
	.dwattr DW$294, DW_AT_name("CANREC"), DW_AT_symbol_name("_CANREC")
	.dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
DW$295	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
	.dwattr DW$295, DW_AT_name("CANGIF0"), DW_AT_symbol_name("_CANGIF0")
	.dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
DW$296	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
	.dwattr DW$296, DW_AT_name("CANGIM"), DW_AT_symbol_name("_CANGIM")
	.dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
DW$297	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
	.dwattr DW$297, DW_AT_name("CANGIF1"), DW_AT_symbol_name("_CANGIF1")
	.dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
DW$298	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
	.dwattr DW$298, DW_AT_name("CANMIM"), DW_AT_symbol_name("_CANMIM")
	.dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
DW$299	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
	.dwattr DW$299, DW_AT_name("CANMIL"), DW_AT_symbol_name("_CANMIL")
	.dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
DW$300	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
	.dwattr DW$300, DW_AT_name("CANOPC"), DW_AT_symbol_name("_CANOPC")
	.dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
DW$301	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
	.dwattr DW$301, DW_AT_name("CANTIOC"), DW_AT_symbol_name("_CANTIOC")
	.dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
DW$302	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
	.dwattr DW$302, DW_AT_name("CANRIOC"), DW_AT_symbol_name("_CANRIOC")
	.dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
DW$303	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$303, DW_AT_name("CANTSC"), DW_AT_symbol_name("_CANTSC")
	.dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
DW$304	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
	.dwattr DW$304, DW_AT_name("CANTOC"), DW_AT_symbol_name("_CANTOC")
	.dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
	.dwattr DW$305, DW_AT_name("CANTOS"), DW_AT_symbol_name("_CANTOS")
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$119


DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$131, DW_AT_name("ECAN_MBOXES")
	.dwattr DW$T$131, DW_AT_byte_size(0x100)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$306, DW_AT_name("MBOX0"), DW_AT_symbol_name("_MBOX0")
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$307, DW_AT_name("MBOX1"), DW_AT_symbol_name("_MBOX1")
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$308, DW_AT_name("MBOX2"), DW_AT_symbol_name("_MBOX2")
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
DW$309	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$309, DW_AT_name("MBOX3"), DW_AT_symbol_name("_MBOX3")
	.dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
DW$310	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$310, DW_AT_name("MBOX4"), DW_AT_symbol_name("_MBOX4")
	.dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
DW$311	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$311, DW_AT_name("MBOX5"), DW_AT_symbol_name("_MBOX5")
	.dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
DW$312	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$312, DW_AT_name("MBOX6"), DW_AT_symbol_name("_MBOX6")
	.dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
DW$313	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$313, DW_AT_name("MBOX7"), DW_AT_symbol_name("_MBOX7")
	.dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
DW$314	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$314, DW_AT_name("MBOX8"), DW_AT_symbol_name("_MBOX8")
	.dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
DW$315	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$315, DW_AT_name("MBOX9"), DW_AT_symbol_name("_MBOX9")
	.dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
DW$316	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$316, DW_AT_name("MBOX10"), DW_AT_symbol_name("_MBOX10")
	.dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
DW$317	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$317, DW_AT_name("MBOX11"), DW_AT_symbol_name("_MBOX11")
	.dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
DW$318	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$318, DW_AT_name("MBOX12"), DW_AT_symbol_name("_MBOX12")
	.dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
DW$319	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$319, DW_AT_name("MBOX13"), DW_AT_symbol_name("_MBOX13")
	.dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
DW$320	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$320, DW_AT_name("MBOX14"), DW_AT_symbol_name("_MBOX14")
	.dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
DW$321	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$321, DW_AT_name("MBOX15"), DW_AT_symbol_name("_MBOX15")
	.dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
DW$322	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$322, DW_AT_name("MBOX16"), DW_AT_symbol_name("_MBOX16")
	.dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
DW$323	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$323, DW_AT_name("MBOX17"), DW_AT_symbol_name("_MBOX17")
	.dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
DW$324	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$324, DW_AT_name("MBOX18"), DW_AT_symbol_name("_MBOX18")
	.dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
DW$325	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$325, DW_AT_name("MBOX19"), DW_AT_symbol_name("_MBOX19")
	.dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
DW$326	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$326, DW_AT_name("MBOX20"), DW_AT_symbol_name("_MBOX20")
	.dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
DW$327	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$327, DW_AT_name("MBOX21"), DW_AT_symbol_name("_MBOX21")
	.dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
DW$328	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$328, DW_AT_name("MBOX22"), DW_AT_symbol_name("_MBOX22")
	.dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
DW$329	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$329, DW_AT_name("MBOX23"), DW_AT_symbol_name("_MBOX23")
	.dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
DW$330	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$330, DW_AT_name("MBOX24"), DW_AT_symbol_name("_MBOX24")
	.dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
DW$331	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$331, DW_AT_name("MBOX25"), DW_AT_symbol_name("_MBOX25")
	.dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
DW$332	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$332, DW_AT_name("MBOX26"), DW_AT_symbol_name("_MBOX26")
	.dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
DW$333	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$333, DW_AT_name("MBOX27"), DW_AT_symbol_name("_MBOX27")
	.dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
DW$334	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$334, DW_AT_name("MBOX28"), DW_AT_symbol_name("_MBOX28")
	.dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
DW$335	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$335, DW_AT_name("MBOX29"), DW_AT_symbol_name("_MBOX29")
	.dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
DW$336	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$336, DW_AT_name("MBOX30"), DW_AT_symbol_name("_MBOX30")
	.dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
DW$337	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
	.dwattr DW$337, DW_AT_name("MBOX31"), DW_AT_symbol_name("_MBOX31")
	.dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$131


DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$134, DW_AT_name("LAM_REGS")
	.dwattr DW$T$134, DW_AT_byte_size(0x40)
DW$338	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$338, DW_AT_name("LAM0"), DW_AT_symbol_name("_LAM0")
	.dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
DW$339	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$339, DW_AT_name("LAM1"), DW_AT_symbol_name("_LAM1")
	.dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
DW$340	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$340, DW_AT_name("LAM2"), DW_AT_symbol_name("_LAM2")
	.dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
DW$341	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$341, DW_AT_name("LAM3"), DW_AT_symbol_name("_LAM3")
	.dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
DW$342	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$342, DW_AT_name("LAM4"), DW_AT_symbol_name("_LAM4")
	.dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
DW$343	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$343, DW_AT_name("LAM5"), DW_AT_symbol_name("_LAM5")
	.dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
DW$344	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$344, DW_AT_name("LAM6"), DW_AT_symbol_name("_LAM6")
	.dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
DW$345	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$345, DW_AT_name("LAM7"), DW_AT_symbol_name("_LAM7")
	.dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
DW$346	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$346, DW_AT_name("LAM8"), DW_AT_symbol_name("_LAM8")
	.dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
DW$347	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$347, DW_AT_name("LAM9"), DW_AT_symbol_name("_LAM9")
	.dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
DW$348	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$348, DW_AT_name("LAM10"), DW_AT_symbol_name("_LAM10")
	.dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
DW$349	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$349, DW_AT_name("LAM11"), DW_AT_symbol_name("_LAM11")
	.dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
DW$350	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$350, DW_AT_name("LAM12"), DW_AT_symbol_name("_LAM12")
	.dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
DW$351	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$351, DW_AT_name("LAM13"), DW_AT_symbol_name("_LAM13")
	.dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
DW$352	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$352, DW_AT_name("LAM14"), DW_AT_symbol_name("_LAM14")
	.dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
DW$353	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$353, DW_AT_name("LAM15"), DW_AT_symbol_name("_LAM15")
	.dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
DW$354	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$354, DW_AT_name("LAM16"), DW_AT_symbol_name("_LAM16")
	.dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
DW$355	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$355, DW_AT_name("LAM17"), DW_AT_symbol_name("_LAM17")
	.dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
DW$356	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$356, DW_AT_name("LAM18"), DW_AT_symbol_name("_LAM18")
	.dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
DW$357	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$357, DW_AT_name("LAM19"), DW_AT_symbol_name("_LAM19")
	.dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
DW$358	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$358, DW_AT_name("LAM20"), DW_AT_symbol_name("_LAM20")
	.dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
DW$359	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$359, DW_AT_name("LAM21"), DW_AT_symbol_name("_LAM21")
	.dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
DW$360	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$360, DW_AT_name("LAM22"), DW_AT_symbol_name("_LAM22")
	.dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
DW$361	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$361, DW_AT_name("LAM23"), DW_AT_symbol_name("_LAM23")
	.dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
DW$362	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$362, DW_AT_name("LAM24"), DW_AT_symbol_name("_LAM24")
	.dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
DW$363	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$363, DW_AT_name("LAM25"), DW_AT_symbol_name("_LAM25")
	.dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
DW$364	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$364, DW_AT_name("LAM26"), DW_AT_symbol_name("_LAM26")
	.dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
DW$365	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$365, DW_AT_name("LAM27"), DW_AT_symbol_name("_LAM27")
	.dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
DW$366	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$366, DW_AT_name("LAM28"), DW_AT_symbol_name("_LAM28")
	.dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
DW$367	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$367, DW_AT_name("LAM29"), DW_AT_symbol_name("_LAM29")
	.dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
DW$368	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$368, DW_AT_name("LAM30"), DW_AT_symbol_name("_LAM30")
	.dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
DW$369	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
	.dwattr DW$369, DW_AT_name("LAM31"), DW_AT_symbol_name("_LAM31")
	.dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$134


DW$T$135	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$135, DW_AT_name("MOTS_REGS")
	.dwattr DW$T$135, DW_AT_byte_size(0x40)
DW$370	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$370, DW_AT_name("MOTS0"), DW_AT_symbol_name("_MOTS0")
	.dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
DW$371	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$371, DW_AT_name("MOTS1"), DW_AT_symbol_name("_MOTS1")
	.dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
DW$372	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$372, DW_AT_name("MOTS2"), DW_AT_symbol_name("_MOTS2")
	.dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
DW$373	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$373, DW_AT_name("MOTS3"), DW_AT_symbol_name("_MOTS3")
	.dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
DW$374	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$374, DW_AT_name("MOTS4"), DW_AT_symbol_name("_MOTS4")
	.dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
DW$375	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$375, DW_AT_name("MOTS5"), DW_AT_symbol_name("_MOTS5")
	.dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
DW$376	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$376, DW_AT_name("MOTS6"), DW_AT_symbol_name("_MOTS6")
	.dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
DW$377	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$377, DW_AT_name("MOTS7"), DW_AT_symbol_name("_MOTS7")
	.dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
DW$378	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$378, DW_AT_name("MOTint"), DW_AT_symbol_name("_MOTint")
	.dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
DW$379	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$379, DW_AT_name("MOTS9"), DW_AT_symbol_name("_MOTS9")
	.dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
DW$380	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$380, DW_AT_name("MOTS10"), DW_AT_symbol_name("_MOTS10")
	.dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
DW$381	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$381, DW_AT_name("MOTS11"), DW_AT_symbol_name("_MOTS11")
	.dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
DW$382	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$382, DW_AT_name("MOTS12"), DW_AT_symbol_name("_MOTS12")
	.dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
DW$383	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$383, DW_AT_name("MOTS13"), DW_AT_symbol_name("_MOTS13")
	.dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
DW$384	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$384, DW_AT_name("MOTS14"), DW_AT_symbol_name("_MOTS14")
	.dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
DW$385	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$385, DW_AT_name("MOTS15"), DW_AT_symbol_name("_MOTS15")
	.dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
DW$386	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$386, DW_AT_name("MOTS16"), DW_AT_symbol_name("_MOTS16")
	.dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$387, DW_AT_name("MOTS17"), DW_AT_symbol_name("_MOTS17")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$388, DW_AT_name("MOTS18"), DW_AT_symbol_name("_MOTS18")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$389, DW_AT_name("MOTS19"), DW_AT_symbol_name("_MOTS19")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$390, DW_AT_name("MOTS20"), DW_AT_symbol_name("_MOTS20")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$391, DW_AT_name("MOTS21"), DW_AT_symbol_name("_MOTS21")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$392, DW_AT_name("MOTS22"), DW_AT_symbol_name("_MOTS22")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$393, DW_AT_name("MOTS23"), DW_AT_symbol_name("_MOTS23")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$394, DW_AT_name("MOTS24"), DW_AT_symbol_name("_MOTS24")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$395, DW_AT_name("MOTS25"), DW_AT_symbol_name("_MOTS25")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$396, DW_AT_name("MOTS26"), DW_AT_symbol_name("_MOTS26")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
DW$397	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$397, DW_AT_name("MOTS27"), DW_AT_symbol_name("_MOTS27")
	.dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
DW$398	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$398, DW_AT_name("MOTS28"), DW_AT_symbol_name("_MOTS28")
	.dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
DW$399	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$399, DW_AT_name("MOTS29"), DW_AT_symbol_name("_MOTS29")
	.dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
DW$400	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$400, DW_AT_name("MOTS30"), DW_AT_symbol_name("_MOTS30")
	.dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
DW$401	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$401, DW_AT_name("MOTS31"), DW_AT_symbol_name("_MOTS31")
	.dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$135


DW$T$136	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$136, DW_AT_name("MOTO_REGS")
	.dwattr DW$T$136, DW_AT_byte_size(0x40)
DW$402	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$402, DW_AT_name("MOTO0"), DW_AT_symbol_name("_MOTO0")
	.dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
DW$403	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$403, DW_AT_name("MOTO1"), DW_AT_symbol_name("_MOTO1")
	.dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
DW$404	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$404, DW_AT_name("MOTO2"), DW_AT_symbol_name("_MOTO2")
	.dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
DW$405	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$405, DW_AT_name("MOTO3"), DW_AT_symbol_name("_MOTO3")
	.dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
DW$406	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$406, DW_AT_name("MOTO4"), DW_AT_symbol_name("_MOTO4")
	.dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
DW$407	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$407, DW_AT_name("MOTO5"), DW_AT_symbol_name("_MOTO5")
	.dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
DW$408	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$408, DW_AT_name("MOTO6"), DW_AT_symbol_name("_MOTO6")
	.dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
DW$409	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$409, DW_AT_name("MOTO7"), DW_AT_symbol_name("_MOTO7")
	.dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
DW$410	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$410, DW_AT_name("MOTO8"), DW_AT_symbol_name("_MOTO8")
	.dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
DW$411	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$411, DW_AT_name("MOTO9"), DW_AT_symbol_name("_MOTO9")
	.dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
DW$412	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$412, DW_AT_name("MOTO10"), DW_AT_symbol_name("_MOTO10")
	.dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
DW$413	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$413, DW_AT_name("MOTO11"), DW_AT_symbol_name("_MOTO11")
	.dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
DW$414	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$414, DW_AT_name("MOTO12"), DW_AT_symbol_name("_MOTO12")
	.dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
DW$415	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$415, DW_AT_name("MOTO13"), DW_AT_symbol_name("_MOTO13")
	.dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
DW$416	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$416, DW_AT_name("MOTO14"), DW_AT_symbol_name("_MOTO14")
	.dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
DW$417	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$417, DW_AT_name("MOTO15"), DW_AT_symbol_name("_MOTO15")
	.dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
DW$418	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$418, DW_AT_name("MOTO16"), DW_AT_symbol_name("_MOTO16")
	.dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
DW$419	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$419, DW_AT_name("MOTO17"), DW_AT_symbol_name("_MOTO17")
	.dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
DW$420	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$420, DW_AT_name("MOTO18"), DW_AT_symbol_name("_MOTO18")
	.dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
DW$421	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$421, DW_AT_name("MOTO19"), DW_AT_symbol_name("_MOTO19")
	.dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
DW$422	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$422, DW_AT_name("MOTO20"), DW_AT_symbol_name("_MOTO20")
	.dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
DW$423	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$423, DW_AT_name("MOTO21"), DW_AT_symbol_name("_MOTO21")
	.dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
DW$424	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$424, DW_AT_name("MOTO22"), DW_AT_symbol_name("_MOTO22")
	.dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
DW$425	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$425, DW_AT_name("MOTO23"), DW_AT_symbol_name("_MOTO23")
	.dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
DW$426	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$426, DW_AT_name("MOTO24"), DW_AT_symbol_name("_MOTO24")
	.dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
DW$427	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$427, DW_AT_name("MOTO25"), DW_AT_symbol_name("_MOTO25")
	.dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
DW$428	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$428, DW_AT_name("MOTO26"), DW_AT_symbol_name("_MOTO26")
	.dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
DW$429	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$429, DW_AT_name("MOTO27"), DW_AT_symbol_name("_MOTO27")
	.dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
DW$430	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$430, DW_AT_name("MOTO28"), DW_AT_symbol_name("_MOTO28")
	.dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
DW$431	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$431, DW_AT_name("MOTO29"), DW_AT_symbol_name("_MOTO29")
	.dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
DW$432	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$432, DW_AT_name("MOTO30"), DW_AT_symbol_name("_MOTO30")
	.dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
DW$433	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$433, DW_AT_name("MOTO31"), DW_AT_symbol_name("_MOTO31")
	.dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$136


DW$T$181	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$181, DW_AT_name("EPWM_REGS")
	.dwattr DW$T$181, DW_AT_byte_size(0x22)
DW$434	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$138)
	.dwattr DW$434, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
	.dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
DW$435	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$140)
	.dwattr DW$435, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
	.dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
DW$436	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$142)
	.dwattr DW$436, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
	.dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
DW$437	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$437, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
	.dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
DW$438	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$438, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
	.dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
DW$439	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
